Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/hardware/stm32h72x73x_pinmap.h
#define GPIO_LTDC_VSYNC_1          (GPIO_ALT|GPIO_AF14|GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN4)
#define GPIO_LTDC_VSYNC_2          (GPIO_ALT|GPIO_AF14|GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN7)

/* Low Power Timer */

/* Low-power universal asynchronous receiver transmitter (LPUART) */

/* Clocks outputs */

#define GPIO_MCO2_0               (GPIO_ALT|GPIO_AF0|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN9)

/* Management data input/output */
#define GPIO_OSPIM_P1_CLK_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTA|GPIO_PIN3)
#define GPIO_OSPIM_P1_CLK_1       (GPIO_ALT|GPIO_AF9|GPIO_PORTB|GPIO_PIN2)
#define GPIO_OSPIM_P1_CLK_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN10)
#define GPIO_OSPIM_P1_NCLK_0      (GPIO_ALT|GPIO_AF3|GPIO_PORTB|GPIO_PIN12)
#define GPIO_OSPIM_P1_NCLK_1      (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN11)
#define GPIO_OSPIM_P1_NCS_0       (GPIO_ALT|GPIO_AF10|GPIO_PORTB|GPIO_PIN6)
#define GPIO_OSPIM_P1_NCS_1       (GPIO_ALT|GPIO_AF9|GPIO_PORTB|GPIO_PIN10)
#define GPIO_OSPIM_P1_NCS_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTC|GPIO_PIN11)
#define GPIO_OSPIM_P1_NCS_3       (GPIO_ALT|GPIO_AF11|GPIO_PORTE|GPIO_PIN11)
#define GPIO_OSPIM_P1_NCS_4       (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN6)
#define GPIO_OSPIM_P1_DQS_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTA|GPIO_PIN1)
#define GPIO_OSPIM_P1_DQS_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTB|GPIO_PIN2)
#define GPIO_OSPIM_P1_DQS_2       (GPIO_ALT|GPIO_AF10|GPIO_PORTC|GPIO_PIN5)
#define GPIO_OSPIM_P1_IO0_0       (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN2)
#define GPIO_OSPIM_P1_IO0_1       (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN1)
#define GPIO_OSPIM_P1_IO0_2       (GPIO_ALT|GPIO_AF12|GPIO_PORTB|GPIO_PIN12)
#define GPIO_OSPIM_P1_IO0_3       (GPIO_ALT|GPIO_AF9|GPIO_PORTC|GPIO_PIN3)
#define GPIO_OSPIM_P1_IO0_4       (GPIO_ALT|GPIO_AF9|GPIO_PORTC|GPIO_PIN9)
#define GPIO_OSPIM_P1_IO0_5       (GPIO_ALT|GPIO_AF9|GPIO_PORTD|GPIO_PIN11)
#define GPIO_OSPIM_P1_IO0_6       (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN8)
#define GPIO_OSPIM_P1_IO1_0       (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN0)
#define GPIO_OSPIM_P1_IO1_1       (GPIO_ALT|GPIO_AF9|GPIO_PORTC|GPIO_PIN10)
#define GPIO_OSPIM_P1_IO1_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTD|GPIO_PIN12)
#define GPIO_OSPIM_P1_IO1_3       (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN9)
#define GPIO_OSPIM_P1_IO2_0       (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN3)
#define GPIO_OSPIM_P1_IO2_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTA|GPIO_PIN7)
#define GPIO_OSPIM_P1_IO2_2       (GPIO_ALT|GPIO_AF4|GPIO_PORTB|GPIO_PIN13)
#define GPIO_OSPIM_P1_IO2_3       (GPIO_ALT|GPIO_AF9|GPIO_PORTC|GPIO_PIN2)
#define GPIO_OSPIM_P1_IO2_4       (GPIO_ALT|GPIO_AF9|GPIO_PORTE|GPIO_PIN2)
#define GPIO_OSPIM_P1_IO2_5       (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN7)
#define GPIO_OSPIM_P1_IO3_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTA|GPIO_PIN1)
#define GPIO_OSPIM_P1_IO3_1       (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN6)
#define GPIO_OSPIM_P1_IO3_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTD|GPIO_PIN13)
#define GPIO_OSPIM_P1_IO3_3       (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN6)
#define GPIO_OSPIM_P1_IO4_0       (GPIO_ALT|GPIO_AF10|GPIO_PORTC|GPIO_PIN1)
#define GPIO_OSPIM_P1_IO4_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN4)
#define GPIO_OSPIM_P1_IO4_2       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN7)
#define GPIO_OSPIM_P1_IO5_0       (GPIO_ALT|GPIO_AF4|GPIO_PORTC|GPIO_PIN2)
#define GPIO_OSPIM_P1_IO5_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN5)
#define GPIO_OSPIM_P1_IO5_2       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN8)
#define GPIO_OSPIM_P1_IO6_0       (GPIO_ALT|GPIO_AF4|GPIO_PORTC|GPIO_PIN3)
#define GPIO_OSPIM_P1_IO6_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN9)
#define GPIO_OSPIM_P1_IO6_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN9)
#define GPIO_OSPIM_P1_IO7_0       (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN7)
#define GPIO_OSPIM_P1_IO7_1       (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN10)
#define GPIO_OSPIM_P1_IO7_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN14)

#define GPIO_OSPIM_P2_CLK_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN4)
#define GPIO_OSPIM_P2_NCLK_0      (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN5)
#define GPIO_OSPIM_P2_NCS_0       (GPIO_ALT|GPIO_AF3|GPIO_PORTG|GPIO_PIN12)
#define GPIO_OSPIM_P2_DQS_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN12)
#define GPIO_OSPIM_P2_DQS_1       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN7)
#define GPIO_OSPIM_P2_DQS_2       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN15)
#define GPIO_OSPIM_P2_IO0_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN0)
#define GPIO_OSPIM_P2_IO1_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN1)
#define GPIO_OSPIM_P2_IO2_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN2)
#define GPIO_OSPIM_P2_IO3_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTF|GPIO_PIN3)
#define GPIO_OSPIM_P2_IO4_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN0)
#define GPIO_OSPIM_P2_IO5_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN1)
#define GPIO_OSPIM_P2_IO6_0       (GPIO_ALT|GPIO_AF3|GPIO_PORTG|GPIO_PIN10)
#define GPIO_OSPIM_P2_IO7_0       (GPIO_ALT|GPIO_AF9|GPIO_PORTG|GPIO_PIN11)

/* USB on-the-go full-speed (OTG_FS) */

/* USB on-the-go high-speed (OTG_HS) */

#define GPIO_OTGHS_DM             (GPIO_SPEED_2MHz|GPIO_PUSHPULL|GPIO_FLOAT|GPIO_PORTA|GPIO_PIN11)
#define GPIO_OTGHS_DP             (GPIO_SPEED_2MHz|GPIO_PUSHPULL|GPIO_FLOAT|GPIO_PORTA|GPIO_PIN12)

/* QuadSPI */

/* RTC */

/* Serial Audio Interface */

#define GPIO_SAI4_CK1_0           (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN2)
#define GPIO_SAI4_CK2_0           (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN5)
#define GPIO_SAI4_D1_1            (GPIO_ALT|GPIO_AF1|GPIO_PORTB|GPIO_PIN2)
#define GPIO_SAI4_D1_2            (GPIO_ALT|GPIO_AF1|GPIO_PORTC|GPIO_PIN1)
#define GPIO_SAI4_D1_3            (GPIO_ALT|GPIO_AF1|GPIO_PORTD|GPIO_PIN6)
#define GPIO_SAI4_D1_4            (GPIO_ALT|GPIO_AF9|GPIO_PORTE|GPIO_PIN6)
#define GPIO_SAI4_D2_0            (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN4)
#define GPIO_SAI4_D3_1            (GPIO_ALT|GPIO_AF1|GPIO_PORTC|GPIO_PIN5)
#define GPIO_SAI4_D3_2            (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN10)
#define GPIO_SAI4_FS_A_1          (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN12)
#define GPIO_SAI4_FS_A_2          (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN4)
#define GPIO_SAI4_FS_B_1          (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN12)
#define GPIO_SAI4_FS_B_2          (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN0)
#define GPIO_SAI4_FS_B_3          (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN13)
#define GPIO_SAI4_FS_B_4          (GPIO_ALT|GPIO_AF8|GPIO_PORTF|GPIO_PIN9)
#define GPIO_SAI4_FS_B_5          (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN9)
#define GPIO_SAI4_MCLK_A_1        (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN0)
#define GPIO_SAI4_MCLK_A_2        (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN2)
#define GPIO_SAI4_MCLK_B_1        (GPIO_ALT|GPIO_AF10|GPIO_PORTA|GPIO_PIN1)
#define GPIO_SAI4_MCLK_B_2        (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN6)
#define GPIO_SAI4_MCLK_B_3        (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN14)
#define GPIO_SAI4_MCLK_B_4        (GPIO_ALT|GPIO_AF8|GPIO_PORTF|GPIO_PIN7)
#define GPIO_SAI4_MCLK_B_5        (GPIO_ALT|GPIO_AF10|GPIO_PORTH|GPIO_PIN3)
#define GPIO_SAI4_SCK_A_1         (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN13)
#define GPIO_SAI4_SCK_A_2         (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN5)
#define GPIO_SAI4_SCK_B_1         (GPIO_ALT|GPIO_AF8|GPIO_PORTA|GPIO_PIN2)
#define GPIO_SAI4_SCK_B_2         (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN12)
#define GPIO_SAI4_SCK_B_3         (GPIO_ALT|GPIO_AF8|GPIO_PORTF|GPIO_PIN8)
#define GPIO_SAI4_SCK_B_4         (GPIO_ALT|GPIO_AF10|GPIO_PORTH|GPIO_PIN2)
#define GPIO_SAI4_SD_A_1          (GPIO_ALT|GPIO_AF8|GPIO_PORTB|GPIO_PIN2)
#define GPIO_SAI4_SD_A_2          (GPIO_ALT|GPIO_AF8|GPIO_PORTC|GPIO_PIN1)
#define GPIO_SAI4_SD_A_3          (GPIO_ALT|GPIO_AF8|GPIO_PORTD|GPIO_PIN6)
#define GPIO_SAI4_SD_A_4          (GPIO_ALT|GPIO_AF10|GPIO_PORTD|GPIO_PIN11)
#define GPIO_SAI4_SD_A_5          (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN6)
#define GPIO_SAI4_SD_B_1          (GPIO_ALT|GPIO_AF10|GPIO_PORTA|GPIO_PIN0)
#define GPIO_SAI4_SD_B_2          (GPIO_ALT|GPIO_AF8|GPIO_PORTE|GPIO_PIN3)
#define GPIO_SAI4_SD_B_3          (GPIO_ALT|GPIO_AF10|GPIO_PORTE|GPIO_PIN11)
#define GPIO_SAI4_SD_B_4          (GPIO_ALT|GPIO_AF8|GPIO_PORTF|GPIO_PIN6)
#define GPIO_SAI4_SD_B_5          (GPIO_ALT|GPIO_AF10|GPIO_PORTF|GPIO_PIN11)
#define GPIO_SAI4_SD_B_6          (GPIO_ALT|GPIO_AF10|GPIO_PORTG|GPIO_PIN10)

